OOP

1. Полиморфизм:
это объектно-ориентированная концепция, в которой одна и та же функция может использоваться для разных целей. Например, имя функции останется прежним, но оно будет принимать разное количество аргументов и может выполнять разные задачи.

2. Конструктор: 
относится к специальному типу функции, которая будет вызываться автоматически при каждом формировании объекта из класса.

3. Деструктор:
относится к специальному типу функции, которая будет вызываться автоматически всякий раз, когда объект удаляется или выходит из области видимости.

------------------------------------------------------------------------------------------------------------------------------------------------------------

PHP Data Types

boolean
integer
float
string
array
object
resource
NULL

------------------------------------------------------------------------------------------------------------------------------------------------------------

